/*
Урок 9.  Как не нужно писать код. Часть 3
*/

/*-----------------------------------------------------------------
Задача 1 Задайте значение N. Напишите программу, которая выведет 
все натуральные числа в промежутке от 1 до N.
-------------------------------------------------------------------
*/
// void ShowNumbers(int lastNumber)
// {
//     if (lastNumber > 1) ShowNumbers(lastNumber - 1);
//     Console.Write($"{lastNumber} ");
// }
// ShowNumbers(10);
// *** Конец Задачи 1 ***


/*-----------------------------------------------------------------
Задача 2 Напишите программу, которая будет принимать на вход число 
и возвращать сумму его цифр.
-------------------------------------------------------------------
*/
// int Sum_OfDigits(int number, int sumDigits = 0)
// int Sum_OfDigits(int number)
// {
//     if (number > 0) return Sum_OfDigits(number / 10) +  number % 10;
//     else return 0;
//  }

// Console.WriteLine(Sum_OfDigits(25418));
// *** Конец Задачи 2 ***


/*--------------------------------------------------------------------------
Задача 3 Задайте значения M и N. Напишите программу, которая выведет 
все натуральные числа в промежутке от M до N, в т.ч. для случая когда M < N
----------------------------------------------------------------------------
*/
// void ShowNumbersRange(int M, int N)
// {
//     if (M != N) ShowNumbersRange(M, N + (M < N ? -1 : 1) );
//     Console.Write($"{N} ");
// }

// for (int i = 0; i < 2; i++)
// {
//     int M = (1 - 2 * i) * 3; int N = -20;
//     ShowNumbersRange(M, N);
// }
// *** Конец Задачи 3 ***


/*-----------------------------------------------------------------
Задача 4 Напишите программу, которая на вход принимает два числа 
A и B, и возводит число А в целую степень B с помощью рекурсии,
в т.ч. для отрицательной степени.
-------------------------------------------------------------------
*/
double Pow_AB(double A, int B)
{
    double a = (B > 0) ? A : 1 / A;
    int dB = (B > 0) ? 1 : -1;
    if (B != 0) return a * Pow_AB(A, B - dB);
    else return 1;
}

// double A = 4; int B = -3;
// Console.WriteLine(Pow_AB(A, B));

for (int i = 0; i < 2; i++)
{
    double A = 4; int B = (1 - 2 * i) * 3;
    Console.WriteLine(Pow_AB(A, B));
}
// *** Конец Задачи 4 ***
